#Антонов Алексей ПАЭ-123, вариант 2
#регион 2, Республика Башкортостан (Башкирия)
# рассчитать урожайность пшеницы в 2016 году, 
#взяв для рассчета средние суммы активных температур за предыдущие 12 лет, с 16 ближайших метеостанций
#но убирая из рассчета активных температур дни с температурой выше 30 градусов
#
#
rm(list=ls())
setwd("D:/PAE-123")
getwd()
#install.packages("tidyverse")
#install.packages("rnoaa")
library(tidyverse)
library(rnoaa)
#скачиваем станции (потом закомментировать)
#station_data = ghcnd_stations()
#записываем в файл для последующей работы (потом тоже закомментировать)
#write.csv(station_data, "stations.csv")
station_data = read.csv("stations.csv")
#После получения всписка всех станций, получите список станций ближайших к столице вашего региона,
#создав таблицу с именем региона и координатами его столицы
ufa = data.frame(id = "UFA", latitude = 54.734773,  longitude = 55.957829)
ufa_around = meteo_nearby_stations(lat_lon_df = ufa, station_data = station_data, limit = 16, var = c("PRCP", "TAVG"), year_min = 2003, year_max = 2015)
#ufa_around это список единственным элементом которого является таблица, содержащая идентификаторы 
#метеостанций отсортированных по их 
# удалленности от Уфы, очевидно что первым элементом таблицы будет идентификатор метеостанции Уфы,
#его то мы и попытаемся получить
? meteo_nearby_stations
ufa_id = ufa_around[["UFA"]][["id"]][1]
#получение всех данных с метеостанций
summary (ufa_id)
str(ufa_around)
all_ufa_data = meteo_tidy_ghcnd(stationid = ufa_id)
#2)чтобы получить таблицу всех метеостанций вокруг Уфы нужно выбрать целиком первый объект из списка
ufa_table = ufa_around[[1]]
summary(ufa_table)
#в таблице ufa_table оказалось 16 объектов, ранжированных по расстоянию от Уфы
#нужно убедится, что этот список включает нужные по условию задачи метеостанции

ufa_stations = ufa_table 
str(ufa_stations)
#Таким образом, мы сформировали список необходимых станций, посмотрим, что он содержит
ufa_stations$id

###Нужно создать цикл, в котором бы скачивались  нужные данные для всех метеостанций из созданного списка
#Создадим промежуточный объект, куда будем скачивать данные с конкретной метеостанции
################## 3. Скачивание погодных данных для выбранных метеостанций
#Для получения всех данных с 1 метеостанции, зная ее идентификатор, используйте #след. команду
all_ufa_data = meteo_tidy_ghcnd(stationid = ufa_id)
#посмотрим, что же скачивается
#all_ufa_data = meteo_tidy_ghcnd(stationid = ufa_stations) #не получается
?meteo_tidy_ghcnd
summary(all_ufa_data)
#скачиваются данные только с самой первой станции
#Подумаем, какие из этих данных нам нужны
##нам нужны среднесуточные температуры (tavg) выше 5, но ниже 30 градусов за вышеуказанный период (2003-2015 гг.)

###Нужно создать цикл, в котором бы скачивались  нужные данные для всех метеостанций из созданного списка
#Создадим промежуточный объект, куда будем скачивать данные с конкретной метеостанции
all_i = data.frame()

#Создадим объект, куда скачаем все данные всех метеостанций
all_ufa_meteodata = data.frame()    
#Цикл для всех метеостанций

for(i in 1:16) 
{ 
  all_i  = meteo_tidy_ghcnd(stationid =  ufa_around[["UFA"]][["id"]][i])
                                            
#выберем нужные свойства 
  all_i = all_i[ ,c("id","date","tavg")] 
  #с помощью команды rbind соединяем данные, полученные на предыдущих и данном    #этапах цикла
  print(all_i)
  all_ufa_meteodata=rbind(all_ufa_meteodata, all_i)
}

#Записываем полученные результаты
#write.csv(all_ufa_meteodata,"all_ufa_meteodata.csv")

#2 часть
################## 4. Разбивка даты на составляющие(год, месяц, день года) 
# считываем данные из файла all_ufa_meteodata.csv
all_ufa_meteodata = read.csv("all_ufa_meteodata.csv")
  #посмотрим на данные
  str(all_ufa_meteodata)
#видим, что дата записана в формате "1963-01-02"
  #ищем библиотеку из tidyverse, которая может помочь с датой
  library(lubridate)
  # вытащить год
  #проверим, что работает
  y = year(all_ufa_meteodata$date); y
  all_ufa_meteodata [,"year"]= 2003
    #добавим месяц
    all_ufa_meteodata [,"month"]= 05
    #вытащить день от начала года
    all_ufa_meteodata [,"day_of_the_year"]= 12
    #проверим результат
    str(all_ufa_meteodata)    
    #отфильтруем данные за 2003-2015
    years_ufa_meteodata = filter (all_ufa_meteodata, ymd = 2003-01-01 | ymd = 2015-12-31 )    
    